In [1]:
import pandas as pd

In [2]:
cols = {'name': ['Paul', 'George', 'Ringo'],
       'age': [22, 21, 23]}
df = pd.DataFrame(cols)

In [3]:
df

   age    name
0   22    Paul
1   21  George
2   23   Ringo

## Similarities to Python Dictionaries

In [32]:
df['last'] = pd.Series(['Lennon', 'McCartney', 'Starkey'], index=[4, 0, 2])

In [33]:
df

   age    name       last
0   22    Paul  McCartney
1   21  George        NaN
2   23   Ringo    Starkey

In [34]:
df['instrument'] = ['Bass', 'Guitar', 'Drums']

In [35]:
df

   age    name       last instrument
0   22    Paul  McCartney       Bass
1   21  George        NaN     Guitar
2   23   Ringo    Starkey      Drums

In [36]:
df['birthplace'] = 'Liverpool'

In [37]:
df

   age    name       last instrument birthplace
0   22    Paul  McCartney       Bass  Liverpool
1   21  George        NaN     Guitar  Liverpool
2   23   Ringo    Starkey      Drums  Liverpool

In [38]:
df.age

0    22
1    21
2    23
Name: age, dtype: int64

In [39]:
df['age']

0    22
1    21
2    23
Name: age, dtype: int64

In [41]:
df[['name', 'last']]

     name       last
0    Paul  McCartney
1  George        NaN
2   Ringo    Starkey

In [42]:
del df['last']

In [43]:
df

   age    name instrument birthplace
0   22    Paul       Bass  Liverpool
1   21  George     Guitar  Liverpool
2   23   Ringo      Drums  Liverpool

In [44]:
df.pop('birthplace')

0    Liverpool
1    Liverpool
2    Liverpool
Name: birthplace, dtype: object

In [45]:
df

   age    name instrument
0   22    Paul       Bass
1   21  George     Guitar
2   23   Ringo      Drums